OdDAI.CompressedGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for Compressed GUID objects.
\param s [in] A new Compressed GUID value to be assigned represented as an ANSI string.
\returns A reference to the Compressed GUID object modified with the assignment operation.